---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoofBaseLevelParam
source: html/f88df1ca-0138-7bd3-84bd-2ea53dfeccc1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoofBaseLevelParam Property

"Base Level"

## Syntax (C#)
```csharp
public static ForgeTypeId RoofBaseLevelParam { get; }
```